# result = [([[306.2788511321733, 50.12407281199574], [451.91226133010076, 32.96435453843374], [457.7211488678267, 142.87592718800425], [312.08773866989924, 159.03564546156628]], "9854'", 0.38875285736461235), ([[95.18251969601066, 77.09743317289913], [302.18709853788476, 58.27151305392426], [306.8174803039893, 203.90256682710088], [98.81290146211524, 223.72848694607575]], '14하', 0.42204072737788406), ([[343.5857864376269, 170.5857864376269], [376.5504699710346, 164.73665409767554], [379.4142135623731, 183.4142135623731], [346.4495300289654, 189.26334590232446]], "''읽디#", 0.0004523109326374824), ([[296.00992561958003, 190.800992561958], [348.58661865218056, 173.7823624297219], [354.99007438041997, 192.199007438042], [302.41338134781944, 209.2176375702781]], '태 디라하 ', 0.0031037940610875283)]
result = [([[18, 6], [158, 6], [158, 38], [18, 38]], '107가 6540', 0.9519319570751127)]
# result = [([[18, 6], [158, 6], [158, 38], [18, 38]], '107가 6540', 0.9519319570751127)]
#-------------------------------------------------------------------------------------------

result_list = []
plate = ['가', '나', '다', '라', '마', '거', '너', '더', '러', '머', '버', '서', '어', '저', '고', '노', '도', '로', '모', '보', '소', '오', '조', '구', '누', '두', '루', '무', '부', '수', '우', '주', '허', '하', '호', '0', '1', '2', '3', '4', '5', '6', '7', '8', '9']
str_list = []
ttl_list = []

first_num = ''
second_num = ''
# # -------------------한글 & 숫자 추출-------------------
for i in result :
  for j in i[1] :
    for str in plate :
        if j == str:

            if '가'<= str <='힣' :
                str_list.append(str)

            elif '0'<= str <='9' :
                result_list.append(str)
        else:
            continue

result_list.append(str_list[0])
print(result_list)
print(#'클래스 번호:', class_num,
      # '\n클래스 이름: ', class_name,
      '\n차량번호 앞자리: ', first_num,
      '\n차량번호 뒷자리: ', second_num)

# for i in result :
#   for j in i[1] :
#     for str in plate :
#         if j == str :
#             result_list.append(j)

#             if '가'<=j<='힣' :
#                 first_num=result_list[:result_list.index(j)+1]
#                 second_num=result_list[result_list.index(j)+1:]

#                 if 3<=len(first_num)<=4 :
#                     first_num = ''.join(first_num)

#                 else :
#                     first_num = 'error' 
#                     second_num=result_list[:result_list.index(j)+1]

print(#'클래스 번호:', class_num,
      # '\n클래스 이름: ', class_name,
      '\n차량번호 앞자리: ', first_num,
      '\n차량번호 뒷자리: ', second_num)


